<template>
<view class="user-agreement p-lr-30 p-tb-30" v-html="content1"></view>
</template>

<script>
export default {
    name: 'user-agreement',
    navigate: ['navigateTo'],
    data() {
        return {
            content1: '',
        }
    },
    onLoad() {
        console.log(this.$parseURL())
        if (this.$parseURL().n === 1) {
            uni.setNavigationBarTitle({
                title: '用户协议',
            })
            this.content1 = `<h3 style='width:100%;text-align:center' class='m-bottom-30'>夜乐门店用户协议</h3>

    本《夜乐门店服务协议》将帮助您了解以下内容<br />
    <br />
    1. 导言<br />
    2. 服务说明<br />
    3. 服务使用规则<br />
    4. 用户个人信息保护<br />
    5. 责任限制<br />
    6. 服务的变更和中断/终止<br />
    7. 账号注销<br />
    8. 通知<br />
    9. 联系方式<br />
    10. 其他<br />
<br />
    1.<b>导言</b><br /><br />
    
    1.1 本协议是用户（以下也称“您”）与夜乐科技之间的协议，夜乐科技将严格依照本协议条款提供产品与/或服务。本协议条款构成您使用夜乐科技所提供的产品与/或服务及其衍生服务之先决条件，您应当在仔细阅读、充分理解本协议后使用夜乐科技的产品与/或服务，您使用夜乐科技提供的产品与/或服务的行为（包括下载、安装、启动、浏览、注册、登录、使用等），都表示您同意本协议的全部条款；如果您不愿意接受本协议的任一条款，您应不使用或立即停止使用夜乐科技提供的产品与/服务。夜乐科技的平台上出现的相关操作提示、答疑指南、使用帮助或夜乐科技以其他方式向您展示的规则、流程等均构成您使用夜乐科技的产品与/或服务的相关规则的一部分，与本协议具有同等效力。<br />

    1.2 在您接受本协议之后，本协议可能因国家政策、产品与/或服务以及履行本协议的环境发生变化而进行修改，修改后的协议发布在夜乐科技平台的适当位置。如您在本协议更新后继续使用夜乐科技的产品与/或服务，即表示您已充分阅读、理解并接受更新后的本协议并愿意受更新后的本协议约束。<br />

    1.3 本协议所称“用户”，包括注册用户及未注册用户。凡未注册夜乐科技的产品与/或服务的用户，自下载或安装夜乐科技的产品与/或使用夜乐科技的服务时即自动成为夜乐科技的“非注册用户”，须遵循除本协议用户注册规定以外的其他所有条款。<br />

    1.4 本协议所称“夜乐科技”，是指包括广东夜乐科技有限公司及其关联公司在内的企业集团。关联公司是指在现在、将来控制广东夜乐科技有限公司、受广东夜乐科技有限公司控制或与广东夜乐科技有限公司处于共同控制下的公司、机构。控制指通过所有权、有投票权的股份、合同、实际运营关联或其他被依法认定的方式直接或间接地拥有影响被控制对象管理/经营的能力。<br />

    1.5 夜乐科技需要特别提醒您的是：由于夜乐科技的产品和服务较多，为您提供的产品和服务内容也有所不同，本协议为夜乐科技统一适用的一般性用户服务条款。针对夜乐科技的某些特定产品/服务，夜乐科技还将制定特定用户服务协议，以便更具体地向您阐明夜乐科技的服务内容、服务规则等内容，您应在充分阅读并同意特定用户服务协议的全部内容后再使用该特定产品/服务。<br />

    1.6 如果您为未成年人，请在监护人的陪同下阅读本协议，并特别注意未成年人条款。未成年人行使和履行本协议项下的权利和义务视为已获得了监护人的认可。<br />

    1.7 夜乐科技在此善意的提醒您，本协议中与您的权益（可能）存在重大关系的条款，夜乐科技已采用加粗字体来特别提醒您，请您留意重点查阅。同时，双方同意前述条款不属于《合同法》第40条规定的“免除其责任、加重对方责任、排除对方主要权利”的条款，即您和夜乐科技均认可前述条款的合法性及有效性，您不会以夜乐科技未尽到合理提示等义务为由而声称协议中条款非法或无效。<br />

    1.8 如您在阅读本协议过程中有任何疑惑或其他相关事宜的，夜乐科技为您提供了反馈渠道，详见“联系方式”章节，夜乐科技会尽快为您作出解答。<br />
<br />
    2. <b>服务说明</b><br /><br />

    2.1 夜乐科技向用户提供的产品与/或服务，包括但不限于：<br />

    2.1.1yeleonline.com以及其他任何由夜乐科技直接所有或运营的任何网站和APP。<br />

    2.1.2 夜乐科技直接拥有或运营的客户端包括但不限于PC、手机等终端客户端产品。<br />

    2.1.3 夜乐科技平台的用户钱包服务。<br />

    2.1.4 夜乐科技平台的提现服务。<br />

    2.1.5 夜乐科技提供的其他产品和/或服务。<br />

    （以上产品、服务统称为“夜乐科技的产品与/或服务”，上述产品、服务所在的平台统称“夜乐科技的平台”）<br />

    2.2 本协议适用于夜乐科技的所有产品与/或服务，包括但不限于软件、网站、服务以及包含的相关产品或服务功能，用户终端包括但不限于PC端、移动终端等。<br />

    2.3 夜乐科技的产品与/或服务，均仅限于用户在夜乐科技的平台使用，任何以恶意破解等非法手段将夜乐科技的产品与/或服务与夜乐科技的平台分离的行为，均不属于本协议中约定的夜乐科技的产品与服务。由此引起的一切法律后果由行为人负责，夜乐科技将依法追究行为人的法律责任。<br />

    2.4 夜乐科技官方公布的方式为下载、安装、启动、浏览、注册、登录、使用夜乐科技服务的唯一合法方式，用户通过其他任何未经过夜乐科技合法授权的渠道、任何途径、任何方式获取的夜乐科技的产品与服务均为非法取得，夜乐科技概不承认其效力，且一经发现夜乐科技有权立即做出删除、取消、清零、封号等处理，任何因此导致的一切不利后果均由用户自行承担。<br />

    2.5 用户有权在夜乐科技授权的范围内使用其合法获得的夜乐科技账号及账号权限下的功能，但是用户确认其仅享有上述服务和产品的使用权，上述服务和产品及其衍生物的所有权及知识产权均归夜乐科技所有或拥有合法授权（但是经合法渠道取得的实体产品所有权以及账号下归属于用户的个人财产、夜乐门店另有说明的其他权益除外）。夜乐科技有权在法律允许的最大范围内根据实际情况自行决定收回上述使用权而无需通知用户，亦无需征得用户同意。<br />

    2.6 夜乐科技有权提前向用户公告（包括但不限于弹出页面公告、夜乐科技官方网站公告）以修改、替换、升级与夜乐科技提供的任何产品与/或服务和/或上述产品与/或服务相关的任何软件。如果用户不同意夜乐科技提供的任何产品与/或服务和/或上述产品与/或服务相关软件的修改、替换、升级，请直接拒绝、停止、取消，否则视为用户同意夜乐科技提供的任何产品与/或服务和/或上述相关软件的修改、替代、升级，同时前述修改、替换、升级不影响本协议的效力。<br />
<br />
    3. <b>服务使用规则</b><br /><br />

    3.1 用户在申请注册使用夜乐科技产品与/或服务时，必须向夜乐科技提供完整、真实、准确、合法、有效、最新的个人资料。如果上述信息发生变化，用户应及时更改。并保证上述资料系用户本人的真实资料，不得冒用他人身份或使用他人手机号码等注册夜乐门店账号。如果因注册信息不真实或更新不及时或冒用行为等导致的账号纠纷或引发的相关问题，夜乐科技不负任何责任。同时，夜乐科技有权选择根据实际情况暂时或永久封停此账号。<br />

    3.2 用户仅可自行在夜乐科技的官方渠道注册成为夜乐门店注册用户。任何通过其他非夜乐科技官方途径获得的夜乐门店账号信息（包括但不限于购买、租用、借用、分享等方式获得的夜乐门店账号信息，以及恶意利用或破坏夜乐门店注册系统获得的注册账号），夜乐科技不保证其合法性和正常使用性，由此导致账号被封停、注销或收回的，用户自行承担全部责任。<br />

    3.3 用户应当通过真实身份信息认证注册账号，且用户提交的账号名称、头像和简介等注册信息中不得出现违法和不良信息，夜乐科技有权对上述信息及用户的真实身份予以审查，如存在上述情况，夜乐科技有权不予注册。已经注册的，如发现用户以虚假信息骗取账号注册，或其账号头像、简介等注册信息存在违法和不良信息的，夜乐科技有权不经通知单方采取限期改正、清除、临时封停、永久封停、注销登记、收回等措施。<br />

    3.4 用户不得通过任何手段恶意注册夜乐门店账号（包括但不限于使用无效手机号、使用他人身份等恶意注册）或利用夜乐门店账号进行违法活动、捣乱、骚扰、欺骗其他用户以及其他违反本协议的行为，夜乐科技有权对上述账号永久封停、注销登记、收回等措施，由此造成损失，由用户自行承担。同时，夜乐科技有权将上述行为移交有权部门处理。<br />

    3.5 夜乐门店账号所有权归夜乐科技所有，用户仅拥有夜乐门店账号的有限使用权。用户需对其享有使用权的账号下所从事的所有行为承担责任，用户应妥善保管自己的账号、密码，不得将夜乐门店账号转让、出借、出租、售卖或分享予他人使用。否则夜乐科技有权选择根据实际情况暂时或永久封停此账号，当用户的账号或密码遭到未经授权的使用时，用户应当立即通知夜乐科技，否则未经授权的使用行为均视为用户本人的行为。夜乐科技为了保障用户的账号安全可能会定期或不定期采用不同的方式对用户的身份进行验证，包括但不限于要求输入验证码、短消息验证、邮箱认证等。如用户无法完成验证或拒绝验证的，夜乐科技可合理怀疑用户的账号出现异常或被盗，并暂停向用户提供产品与/或服务及/或采取进一步措施。<br />

    3.6 因非夜乐科技原因导致的用户账号信息遗失，用户如需找回的，需按提供要求的信息和证明，并确保提供的信息和证明文件的合法真实有效，若提供的材料不真实或不符合要求，无法通过夜乐科技账号的安全验证，可能会导致账号找回失败，相应的风险和损失用户自行承担。<br />

    3.7 夜乐科技为保障为更多的用户提供更优质的服务，用户同意夜乐科技有权对连续六个月未使用的夜乐门店账号、通过非法方式获取夜乐门店账号和违反本用户协议的夜乐门店账号进行永久注销或收回。<br />

    3.8 用户同意夜乐科技在提供产品与/或服务的过程中以各种方式投放商业性广告或其他任何类型的商业信息，用户同意夜乐科技在取得用户同意后通过电子邮件或其他方式向用户发送商品促销或其他相关商业信息。<br />

    3.9 用户知悉并同意，受限于宽带和网络连接问题，夜乐科技在提供产品与服务的过程中可能会出现需较长时间缓冲或卡顿或其他类似的情况，此类情况并非夜乐门店过错，夜乐科技无需就此类情况向用户承担责任。且为了减少甚至避免上述情况的出现，从而进一步提升用户的服务体验，用户确认夜乐科技可采取一系列技术手段对产品和服务进行优化，包括改进夜乐门店CDN节点分布调度、使用夜乐门店专有HCDN对等网络等提升视频分发质量的技术措施等。<br />

    3.10 用户知悉并同意，夜乐科技提供的产品与服务需接入互联网方可使用，因此用户需自行承担使用产品与服务过程中所产生的上行和下行的网络通信及流量费用，上述费用将由网络运营商收取。<br />

    3.11 用户在使用夜乐科技的产品与/或服务过程中，应遵守宪法法律，包括但不限于《中华人民共和国保守国家秘密法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《互联网电子公告服务管理规定》、《信息网络传播权保护条例》、《网络安全法》等有关计算机及互联网规定的法律、法规；应遵守公共秩序，尊重社会公德，不得危害网络安全，不得利用网络从事危害国家安全、荣誉和利益，煽动颠覆国家政权、推翻社会主义制度，煽动分裂国家、破坏国家统一，宣扬恐怖主义、极端主义，宣扬民族仇恨、民族歧视，传播暴力、淫秽色情信息，编造、传播虚假信息扰乱经济秩序和社会秩序，以及侵害他人名誉、隐私、知识产权和其他合法权益等活动。在任何情况下，夜乐科技一旦合理地认为用户存在上述行为的，可以在任何时候，不经事先通知终止向该用户提供产品与/或服务。<br />

    3.12 禁止用户利用夜乐科技提供的产品和服务从事以下行为：<br />

    3.12.1上传、复制、传送、传播包含任何反对宪法所确定的基本原则、危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一、破坏民族团结、损害国家荣誉和利益、煽动民族仇恨、民族歧视、破坏民族团结、破坏国家宗教政策、宣扬邪教和封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪、侮辱或者诽谤他人，侵害他人合法权益的等法律、行政法规禁止的内容或其他另人反感的图形、信息或其他资料；<br />

    3.12.2 以任何方式危害未成年人；<br />

    3.12.3 冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关；<br />

    3.12.4以其他方式操控识别资料，使人误认为该内容为夜乐科技所传送；<br />

    3.12.5 将无权传送的内容（例如内部资料、机密资料）进行上载、张贴、发送电子邮件或以其他方式传送；<br />

    3.12.6 将侵犯任何人的专利、商标、著作权、商业秘密或其他专属权利之内容加以上载、张贴、发送电子邮件或以其他方式传送；<br />

    3.12.7 将广告函件、促销资料、"垃圾邮件"等，加以上载、张贴、发送电子邮件或以其他方式传送。供前述目的使用的专用区域除外；<br />

    3.12.8 跟踪或以其他方式骚扰他人，非法侵入他人网络、干扰他人网络正常功能、窃取网络数据等危害网络安全的行为；<br />

    3.12.9 向他人提供专门用于从事侵入网络、干扰网络正常功能及防护措施、窃取网络数据等危害网络安全活动的程序、工具，或明知他人从事危害网络安全的活动的，为其提供技术支持、广告推广、支付结算等帮助的行为；<br />

    3.12.10 利用夜乐科技提供的服务设立用于实施诈骗，传授犯罪方法，制作或者销售违禁物品、管制物品等违法犯罪活动的网站、通讯群组，或利用夜乐科技的网络发布涉及实施诈骗，制作或者销售违禁物品、管制物品以及其他违法犯罪活动的信息；<br />

    3.12.11 将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其他方式传送；<br />

    3.12.12 干扰或破坏夜乐科技服务或与夜乐科技服务相连的服务器和网络；<br />

    3.12.13 故意或非故意违反任何相关的中国法律、法规、规章、条例等其他具有法律效力的规范；<br />

    3.12.14 用户需保证其上传内容不得违反广电总局的相关规定，包括但不限于《互联网视听节目服务管理规定》（广电总局56号令）等，其上传内容应当符合法律、行政法规、部门规章的规定，且上传内容不得含有以下内容：<br />

    （一）反对宪法确定的基本原则的；<br />

    （二）危害国家统一、主权和领土完整的；<br />

    （三）泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；<br />

    （四）煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；<br />

    （五）宣扬邪教、迷信的；<br />

    （六）扰乱社会秩序，破坏社会稳定的；<br />

    （七）诱导未成年人违法犯罪和渲染暴力、色情、赌博、恐怖活动的；<br />

    （八）侮辱或者诽谤他人，侵害公民个人隐私等他人合法权益的；<br />

    （九）危害社会公德，损害民族优秀文化传统的；<br />

    （十）有关法律、行政法规和国家规定禁止的其他内容。<br />

    如用户提供的上传内容含有以上违反政策法律法规的信息或者内容的，由用户直接承担以上导致的一切不利后果，如因此给夜乐科技造成不利后果的，用户应负责消除影响，并且赔偿因此导致的一切损失。<br />

    3.12.15 未经夜乐科技事先明确书面许可，以任何方式（包括但不限于机器人软件、蜘蛛软件、爬虫软件等任何自动程序、脚本、软件）和任何理由自行或委托他人、协助他人获取平台的服务、内容、数据；<br />

    3.12.16 未经夜乐科技事先明确授权，以商业性或其他非个人使用等目的为自己或他人获取、使用夜乐科技的产品与/或服务；<br />

    3.12.17 未经夜乐科技明确授权，采用收费或免费的方式，在任何公开场合全部或部分展示夜乐科技的服务内容（但如您的上述行为不构成侵权的除外）；<br />

    3.12.18 通过不正当手段或以违反诚实信用原则的方式（如利用规则漏洞、利用系统漏洞、滥用会员身份、黑色产业、投机等违背夜乐科技提供服务/举办活动的初衷的方式）；<br />

    3.12.19 通过侵犯夜乐科技或他人合法权益的方式；<br />

    3.12.20 其他未经夜乐科技明示授权许可或违反本协议、法律法规或监管政策的行为。<br />

    3.13 用户使用夜乐科技的产品与上传、发布的内容，应保证其上传内容不违反中国大陆地区及使用当地的法律法规及相关规范性文件，亦不侵犯任何第三方的合法权益，否则导致的一切不利后果均由用户自行承担，造成夜乐科技损失的，还应向夜乐科技承担赔偿责任。对于相关权利人因用户违反本款约定向夜乐科技主张权利的，夜乐科技有权不通知上传用户直接删除、下线、屏蔽相关争议内容。<br />

    3.14 用户对其利用夜乐科技服务制作、上传、发布、传播的符号、文字、图片、音频、视频等内容的行为，独立完整地承担法律责任，包括如造成夜乐科技损失的，应向夜乐科技承担赔偿责任。<br />

    3.14.1 为了维护中国大陆地区及用户使用夜乐科技服务地区的法律法规及相关规范性文件、保护他人的合法权益、维护夜乐科技的信誉及安全，夜乐科技有权直接删除用户利用夜乐科技产品上传、发布、传播的符号、文字、图片等内容，而无需事先通知用户。<br />

    3.14.2 夜乐科技有权视情节严重程度对该用户做出封禁ID，冻结钱包，暂时停止、永久禁止其利用夜乐科技产品与/或服务。<br />

    3.14.3 夜乐科技的后台记录有可能作为用户违反法律法规、违约、侵权的证据。<br />

    3.15 用户应当保证，不会利用夜乐科技服务或其衍生服务侵犯夜乐科技以及他人的合法权益，禁止通过网络漏洞、恶意软件或其他非法手段破坏夜乐科技的正常经营，窃取、盗用他人的账号及账号下财产等；禁止侵犯他人合法权益的其他内容。否则，夜乐科技有权根据情节严重而对该用户及用户账号进行冻结、封号等处理。构成犯罪的，夜乐科技有权移交有权部门处理。<br />

    3.16 用户可以向夜乐科技提出咨询和获得夜乐科技服务的合理技术支持，夜乐科技的此项义务不应超过夜乐科技的合理承受限度。<br />

    3.17 如您在夜乐科技的平台上使用第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的服务条款。<br />

    3.18 您知悉并同意，如您存在或夜乐科技经独立判断后认为您存在任何违反国家法律法规或监管政策、违反本协议或有损夜乐科技的声誉、利益的行为的，夜乐科技有权独立决定采取以下一项或多项处理措施：<br />

    3.15.1 如本协议对此行为有单独条款约定处理方式的，按照该条款处理；<br />

    3.15.2 无需通知您而采取一种或多种措施制止您的行为及行为产生的后果，如删除/屏蔽相关链接或内容、限制/取消您的账号/账户使用权限等；<br />

    3.15.3 无需通知您而中断或终止部分或全部服务，且您已交纳的相关服务费用将不予退还或获得任何形式的补偿/赔偿；<br />

    3.15.4 如您的行为使夜乐科技遭受任何损失的，您应当承担全部损失赔偿责任并在夜乐科技要求的时限内完成费用支付。<br />
<br />
    4. <b>用户个人信息保护</b><br /><br />

    4.1 个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。您在下载、安装、启动、浏览、注册、登录、使用夜乐科技的产品与/或服务时，夜乐科技将按照平台公布的《夜乐门店隐私政策》的约定处理和保护您的个人信息，因此希望您能够仔细阅读、充分理解《夜乐门店隐私政策》的全文，并在需要时，按照《夜乐门店隐私政策》的指引，作出您认为适当的选择。<br />

    4.2 您应当在仔细阅读、充分理解《夜乐门店隐私政策》后使用夜乐科技的产品与/或服务，如果您不同意政策的内容，将可能导致夜乐科技的产品与/或服务无法正常运行，或者无法达到夜乐科技拟达到的服务效果，您应立即停止访问/使用夜乐科技的产品与/或服务。您使用或继续使用夜乐科技提供的产品与/或服务的行为，都表示您充分理解和同意《夜乐门店隐私政策》（包括更新版本）的全部内容。<br />

    4.3 夜乐科技深知个人信息对您的重要性，因此夜乐科技非常重视保护您的隐私和个人信息，亦将您的个人信息以高度审慎的义务对待和处理。更多关于个人信息处理和保护规则、您对个人信息的控制权等内容，请您至夜乐科技的平台上查阅《夜乐门店隐私政策》的全文<br />

    4.4 如您对《夜乐门店隐私政策》或对您的个人信息相关内容有任何问题（包括问题咨询、投诉等），您可通过《夜乐门店隐私政策》或本协议文末公布的联系方式联系夜乐科技。<br />
<br />
    5. <b>责任限制</b><br /><br />

    5.1 用户理解并同意，夜乐科技的产品与/或服务是按照现有技术和条件所能达到的现状提供的，夜乐科技无法保证其所提供的产品与/或服务毫无瑕疵，夜乐科技不对提供的产品与/或服务（含技术和信息）作出任何明示或暗示的承诺或保证，包括但不限于质量、稳定、正确、及时、完整、连贯、安全等，但夜乐科技承诺将不断提升服务质量及服务水平，为用户提供更加优质的服务。<br />

    5.2 为了改善用户体验、保证产品、服务的安全性及产品功能的一致性，夜乐科技可能会对软件进行更新。您应将软件更新到最新版本，否则夜乐科技并不保证其一定能正常使用。<br />

    5.3 夜乐科技对如下事项不做担保（包括但不限于）：<br />

    5.3.1 夜乐科技提供的网站、客户端等软件虽然均已经过夜乐科技测试，但由于技术本身的局限性，夜乐科技不能保证其与其他软硬件、系统完全兼容。如果出现不兼容的情况，用户可将情况报告夜乐科技，以获得技术支持。如果无法解决问题，用户可以选择卸载、停止使用夜乐科技的产品与/或服务；<br />

    5.3.2 使用夜乐科技服务涉及到Internet服务，可能会受到各个环节不稳定因素的影响。因不可抗力、黑客攻击、系统不稳定、网络中断、用户关机、通信线路等原因，均可能造成夜乐科技的产品与/或服务中断或不能满足用户要求的情况。夜乐科技不保证夜乐科技的产品与/或服务适合用户的使用要求；<br />

    5.3.3 由于夜乐科技提供的客户端等软件可以通过网络途径下载、传播，因此对于从非夜乐科技指定官方站点下载、非夜乐科技指定途径获得的夜乐科技服务相关软件，夜乐科技无法保证其是否感染计算机病毒、是否隐藏有伪装的木马程序等黑客软件，也不承担用户由此遭受的一切直接或间接损害赔偿等法律责任；<br />

    5.3.4 夜乐科技不做出任何与夜乐科技的产品与/或服务的安全性、可靠性、及时性和性能有关的担保；<br />

    5.3.5 夜乐科技不保证其提供的任何产品、服务或其他材料符合用户的期望。<br />

    5.4 用户使用经由夜乐科技服务下载或取得的任何资料，其风险由用户自行负担，因该使用而导致用户电脑系统损坏或资料流失，用户应负完全责任。<br />

    5.5 基于以下原因而造成的利润、商业信誉、资料损失或其他有形或无形损失，夜乐科技不承担任何直接、间接、附带、衍生或惩罚性的赔偿：<br />

    5.5.1 夜乐科技的产品与/或服务使用或无法使用；<br />

    5.5.2 经由夜乐科技的产品与/或服务购买或取得的任何产品、资料或服务；<br />

    5.5.3 用户资料遭到未授权的使用或修改；<br />

    5.5.4 其他与夜乐科技的产品与/或服务相关的事宜。<br />

    5.6 用户应妥善保管自己的账号和密码，加强密码安全性，谨防账号泄露或被盗。因用户账号被泄露或被盗而造成的任何损失，如账号、账号内财产等丢失、减少的，夜乐科技不承担补偿责任。用户因电信和网通部门的通讯线路故障、网络或电脑故障、系统不稳定、不可抗力（如服务器当机）等非夜乐科技原因造成账号、账号内财产等丢失、减少的，夜乐科技不承担补偿等责任。<br />

    5.7 用户因缺少身份认证或认证信息不真实而导致账号、账号内财产等丢失、减少而无法找回的，夜乐科技不承担任何法律责任。<br />

    5.8 用户理解并同意自主选择免费下载和使用夜乐科技的产品与/或服务，风险自负，包括但不限于用户使用夜乐科技的产品与/或服务过程中的行为，以及因使用夜乐科技的产品与/或服务产生的一切后果。如因下载或使用夜乐科技的产品与/或服务而对计算机系统造成的损坏或数据的丢失等，用户须自行承担全部责任。<br />

    5.9 用户知悉并同意，夜乐科技为了整体运营的需要，或自行决定进行业务变更、调整及技术变更等，有权随时修改或中断、中止或终止产品与/或服务而无需通知用户，也无需向用户或第三方负责或承担任何赔偿责任，除非法律另有规定或双方另有约定。<br />

    5.10 夜乐科技依据其自身判断，对于用户的任何违反或涉嫌违反中国法律或本协议约定的内容，有权视情节删除、屏蔽或断开链接；停止为用户提供服务或予以删除、撤销账户；并有权依据中国法律法规之规定保存有关信息并向相关政府部门进行报告。<br />

    5.11 夜乐科技仅承担本协议明确约定的直接责任。除本协议另有约定外，在任何情况下，夜乐科技对本协议所承担的赔偿责任总额不超过夜乐科技因向您提供产品与/或服务而收取的服务费总额。<br />

    5.12 不论是否可以预见，不论是源于何种形式的行为，夜乐科技不对由任何原因造成的特别的、间接的、惩罚性的、突发性的或有因果关系的损害或其他任何损害（包括但不限于利润或利息的损失、经营中断、资料灭失）承担责任。<br />
<br />
    6. <b>服务的变更和中断/终止</b><br /><br />

    6.1 夜乐科技有权根据夜乐科技的业务发展情况，暂时或永久地变更或终止夜乐科技的产品与/或服务（或任何一部分），无论是否通知用户，夜乐科技对夜乐科技的产品与/或服务的变更或终止对用户和任何第三人不承担违约责任，因在前述情况下变更或终止夜乐科技的产品与/或服务（或任何一部分）导致用户合法权益遭受损失的，在用户提出申请后，夜乐科技将根据确认的实际损失情况给予用户适当的补偿。<br />

    6.2 除前述6.1条所述的情形外，在发生如下情况时，夜乐科技有权中断或终止向用户提供服务：<br />

    6.2.1 您主动提出要求的；<br />

    6.2.2 您存在或夜乐科技经独立判断后认为您存在任何违反国家法律法规或监管政策、违反本协议或有损夜乐科技的声誉、利益的行为的；<br />

    6.2.3 夜乐科技根据法律法规、监管政策的规定或有权机关的要求；<br />

    6.2.4 夜乐科技为维护账号与系统安全等紧急情况之需要；<br />

    6.2.5 不可抗力（鉴于互联网之特殊性质，不可抗力亦包括黑客攻击、电信部门技术调整导致之重大影响、因政府管制而造成之暂时关闭、病毒侵袭等影响互联网正常运行之情形）；<br />

    6.2.6 其他夜乐科技无法抗拒的情况。<br />

    6.3 发生前述6.2条所述之终止的情况时，您与夜乐科技均认可如下处理方式：<br />

    6.3.1 您的账号下已经产生但未使用的权益自动清除且不折现；<br />

    6.3.2 如您在夜乐科技的平台内有正在进行中的交易，夜乐科技届时将视情况进行合理处理；<br />

    6.3.3 除法律法规另有规定或夜乐科技另有说明外，夜乐科技已收取的相关费用不予退还；<br />

    6.3.4 如因您违反本协议导致终止的，夜乐科技有权视情况要求您承担相应的违约责任；<br />

    6.3.5 除法律法规另有规定或夜乐科技另有说明外，夜乐科技无需向您和第三人承担任何责任。<br />
<br />
    7. <b>账号注销</b><br /><br />

    7.1 夜乐科技为您提供夜乐门店账号注销权，您可以通过在线申请注销或联系夜乐科技的客服或通过其他夜乐科技公示的方式注销您的账号（但法律法规另有规定的或本协议另有约定的除外），一旦您注销账号，将无法使用夜乐科技提供的全线用户产品的服务且自动放弃已有的权益，因此请您谨慎操作。除法律法规另有规定外，注销账号之后，夜乐科技将停止为您提供夜乐科技所有的产品和服务，您曾通过该账号使用的夜乐科技的产品与服务下的所有内容、信息、数据、记录将会被删除或匿名化处理。<br />

    7.2 更多关于夜乐门店账号注销的流程、注销应满足条件。如您在谨慎操作后仍执意决定注销您的夜乐门店账号的，您可以在您使用的夜乐科技的产品与/或服务的相关功能设置页面或根据操作指引向夜乐科技提交注销申请。<br />
<br />
    8. <b>通知</b><br /><br />

    8.1 本协议项下夜乐科技对于用户所有的通知均可通过网页公告、电子邮件、手机短信或常规的信件传送等方式进行，该等通知于发送之日视为已送达用户。<br />
<br />
    9. <b>联系方式</b><br /><br />

    9.1 如您对本协议或使用夜乐科技的产品与/或服务相关的事宜有任何问题（包括问题咨询、投诉等），夜乐科技专门为您提供反馈通道，希望为您提供满意的解决方案：<br />

    9.1.1 在线客服/其他在线意见反馈通道：您可与夜乐科技的平台上产品功能页面的在线客服联系或者在线提交意见反馈；<br />

    9.1.2 人工客服通道：您可以拨打夜乐科技的任何一部客服电话与夜乐科技联系；<br />

    9.1.3其他方式：夜乐科技提供的其他反馈通道。<br />

    9.2 夜乐科技会在收到您的反馈后尽快向您答复。<br />
<br />
    10. <b>其他</b><br /><br />

    10.1 本协议的解释及争议解决均应适用中华人民共和国大陆地区法律。与本协议相关的任何纠纷，双方应协商友好解决；若不能协商解决，您同意将争议提交至北京市海淀区人民法院诉讼解决。双方同意，解决争议时，应以您同意的最新《夜乐门店服务协议》为准。<br />

    10.2 因业务发展所需以及为您提供更好的阅读体验，您知悉，本协议的名称、各章节标题仅为方便及阅读而设，且因本协议在我们平台展示之处较多，全部协议更名完毕可能需要一段时间，在此期间内，两个名称的同时存在并不影响正文其中任何条款的含义或解释。<br /><br /><br /><br />`
        }
        if (this.$parseURL().n === 2) {
            uni.setNavigationBarTitle({
                title: '隐私政策',
            })
            this.content1 = `
               <h3 style='width:100%;text-align:center' class='m-bottom-20'>夜乐门店隐私政策</h3> <br />

夜乐科技（以下也称“我们”）深知个人信息对您的重要性，因此我们非常重视保护您的隐私和个人信息，我们亦将本《夜乐门店隐私政策》（以下也称“本政策”）中的内容以高度审慎的义务对待和处理。本政策与您所使用的我们的产品与/或服务息息相关，您在下载、安装、启动、浏览、注册、登录、使用我们的产品与/或服务（以下统称“使用我们的产品与/或服务”或“使用产品与/或服务”）时，我们将按照本政策的约定处理和保护您的个人信息，因此我们希望您能够仔细阅读、充分理解本政策的全文，并在需要时，按照本政策的指引，做出您认为适当的选择。本政策之中涉及的相关技术词汇，我们尽量以简明扼要的表述向您解释，以便于您理解。<br />
您应当在仔细阅读、充分理解本《夜乐门店隐私政策》后选择是否同意本政策的内容以及是否同意使用我们的产品与/或服务，如果您不同意本政策的内容，将可能导致我们的产品与/或服务无法正常运行，或者无法达到我们拟达到的服务效果，您应立即停止访问/使用我们的产品与/或服务。您使用或继续使用我们提供的产品与/或服务的行为，都表示您充分理解和同意本《夜乐门店隐私政策》（包括更新版本）的全部内容。<br />
夜乐科技已经以字体加粗或其他合理方式提示您重点阅读协议中与您的权益（可能）存在重大关系的条款，且双方同意其不属于《合同法》第40条规定的“免除其责任、加重对方责任、排除对方主要权利”的条款，即您和夜乐科技均认可该类条款的合法性及有效性，您不会以夜乐科技未尽到合理提示义务为由而声称协议中条款非法或无效。<br />
如您在阅读本《夜乐门店隐私政策》过程中有任何疑惑或其他相关事宜的，我们为您提供了多种反馈渠道，具体请见本政策“如何联系我们”章节，我们会尽快为您作出解答。<br />
关于我们<br />
夜乐科技是指包括广东夜乐科技有限公司及其关联公司在内。<br />

    关联公司是指在现在、将来控制广东夜乐科技有限公司、受广东夜乐科技有限公司控制或与广东夜乐科技有限公司处于共同控制下的公司、机构。控制指通过所有权、有投票权的股份、合同、实际运营关联或其他被依法认定的方式直接或间接地拥有影响被控制对象管理/经营的能力。<br />

本《夜乐门店隐私政策》将帮助您了解以下内容<br />

    一、 本《夜乐门店隐私政策》适用范围、相关词语涵义<br />
    二、 我们如何收集和使用您的个人信息<br />
    三、 我们如何使用Cookie和同类技术<br />
    四、 我们如何共享、转让、公开披露您的个人信息<br />
    五、 您对个人信息享有的控制权<br />
    六、 我们如何存储和保护您的个人信息<br />
    七、 本《夜乐门店隐私政策》的更新<br />
    八、 如何联系我们<br />
    九、 其他<br />
    <br />
<b>一、本《夜乐门店隐私政策》适用范围、相关词语涵义</b><br /><br />
（一）本《夜乐门店隐私政策》适用范围<br />
本《夜乐门店隐私政策》为我们的所有产品与/或服务统一适用的通用内容，当您使用我们的任何产品与/或服务时，本《夜乐门店隐私政策》即适用，但如该产品与/或服务单独设置了隐私条款/隐私协议的，单独的隐私条款/隐私协议优先适用；单独的隐私条款/隐私协议未提及的内容，适用本政策。但请您注意，本《夜乐门店隐私政策》不适用于以下情况：<br />

    为我们的产品与/或服务提供广告服务的第三方的信息收集/处理做法；<br />
    我们的产品与/或服务可能会包含或链接至第三方提供的信息与/或第三方服务（包括任何第三方应用、网站、产品、服务等），这些信息与/或服务由第三方负责运营，您使用该等信息与/或服务与我们无关。我们在此善意的提醒您，您在使用第三方信息与/或服务时，应留意和仔细阅读第三方向您展示的相关用户协议和隐私政策，并妥善保管和谨慎提供您的个人信息。本《夜乐门店隐私政策》仅适用于我们所收集的您的个人信息，并不适用于任何第三方对您的个人信息的收集，以及任何第三方提供的服务或第三方的信息使用规则，我们对任何第三方收集、储存和使用的您个人信息的行为在法律允许的范围内亦不承担任何责任；<br />

（二）相关词语涵义<br />

    我们的产品与/或服务：包括但不限于我们提供的软件、网站、服务（含站外服务，例如：我们的广告服务和“通过我们的服务申请或分享”的插件等）以及包含的相关产品或服务功能。<br />

    我们需要特别提醒您的是：由于我们的产品和服务较多，为您提供的产品和服务内容也有所不同，本《夜乐门店隐私政策》为夜乐科技统一适用的一般性隐私条款，本政策约定的用户权利和我们提供的相关信息安全保护措施均适用于我们的所有产品和服务；本政策所述之“我们的产品与/或服务”以及我们收集的您个人信息的类型和对应的使用、处理规则等可能会因您使用的具体的产品/服务（包括客户端类型、软件版本等）而有所不同，具体以您实际使用的产品/服务的实际情况为准。针对我们的某些特定产品/服务，我们还将制定特定隐私条款或隐私协议，以便更具体地向您阐明我们的隐私规则和保护措施等内容。<br />
    个人信息（出自于GB/T 35273-2017《信息安全技术 个人信息安全规范》）：指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。本隐私政策中涉及的个人信息包括个人基本资料（包括个人姓名、生日、性别、住址、个人电话号码、电子邮箱）、个人身份信息（包括身份证信息）、个人生物识别信息（包括指纹、面部特征）、网络身份标识信息（包括系统账号、IP地址、邮箱地址以及与前述有关的密码、口令、口令保护答案、用户个人数字证书）、个人财产信息（包括银行账号、鉴别信息（口令）、资金信息（包括资金数量、收益、余额）、交易和消费记录、流水记录、虚拟货币、虚拟交易、通讯录信息、个人上网记录（包括网站浏览记录、软件使用记录、点击记录）、个人常用设备信息（包括硬件序列号、硬件型号、设备MAC地址、操作系统类型、软件列表、唯一设备识别码（如IMEI/android ID/IDFA/OPENUDID/GUID、SIM卡IMSI信息等在内的描述个人常用设备基本情况的信息）、个人位置信息（包括大概地理位置、精准定位信息）。我们实际具体收集的个人信息种类以下文描述为准。<br />
    个人敏感信息（出自于GB/T 35273-2017《信息安全技术 个人信息安全规范》）：指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。本隐私政策中涉及的个人敏感信息包括您的财产信息（包括银行账号、鉴别信息（口令）、资金信息（包括资金数量、收益、余额）、交易和消费记录、流水记录、虚拟货币、虚拟交易、个人生物识别信息（包括指纹、面部特征）、个人身份信息（包括身份证信息）、网络身份识别信息、其他信息（包括通讯录信息、个人电话号码、精准定位信息、收货地址、网页浏览记录）、儿童个人信息。您同意您的个人敏感信息按本《夜乐门店隐私政策》所述的目的和方式来处理。我们实际具体收集的个人敏感信息种类以下文描述为准。相比其他个人信息，个人敏感信息可能对您的个人权益影响更大。我们在此善意的提醒您需在谨慎考虑后再向我们提供您的个人敏感信息。<br />
    儿童：指不满十四周岁的未成年人。（出自于《儿童个人信息网络保护规定》）<br />
    匿名化：指通过对个人信息的技术处理，使得个人信息主体无法被识别，且处理后的信息不能被复原的过程。（出自于GB/T 35273-2017《信息安全技术 个人信息安全规范》）<br />
    去标识化：指通过对个人信息的技术处理，使其在不借助额外信息的情况下，无法识别个人信息主体的过程。（出自于GB/T 35273-2017《信息安全技术 个人信息安全规范》）<br />
    删除：指在实现日常业务功能所涉及的系统中去除个人信息的行为，使其保持不可被检索、访问的状态。（出自于GB/T 35273-2017《信息安全技术 个人信息安全规范》）<br />
<br />
<b>二、我们如何收集和使用您的个人信息</b><br /><br />
您在使用我们的产品与/或服务时，我们需要/可能需要收集和使用您的一些个人信息，我们收集和使用的您的个人信息类型包括两种：第一种：我们产品与/或服务的核心业务功能所必需的信息：此类信息为产品与/或服务正常运行的必备信息，您须授权我们收集。如您拒绝提供，您将无法正常使用我们的产品与/或服务；第二种：我们产品与/或服务的附加业务功能可能需要收集的信息：此信息为非核心业务功能所需的信息，您可以选择是否授权我们收集。如您拒绝提供，将导致附加业务功能无法实现或无法达到我们拟达到的效果，但不影响您对核心业务功能的正常使用。<br />
我们需要特别提醒您的是：由于我们的产品和服务较多，为您提供的内容也不同，因此核心业务功能（包括其收集的您的个人信息类型）也会因产品/服务的内容不同而有所区别，具体以产品/服务实际提供为准。除此之外，您理解并同意，我们希望提供给您的产品和服务是完善的，所以我们会不断改进我们的产品和服务，包括技术，这意味着我们可能会经常推出新的业务功能，可能需要收集新的个人信息或变更个人信息使用目的或方式。如果某一需要收集您的个人信息的功能或产品/服务未能在本《夜乐门店隐私政策》中予以说明的，我们会通过更新本政策、页面提示、弹窗、网站公告等方式另行向您说明该信息收集的目的、内容、使用方式和范围，并为您提供自主选择同意的方式，且在征得您明示同意后收集。在此过程中，如果您对相关事宜有任何疑惑的，可以通过文末提供的方式联系我们，我们会尽快为您作出解答。<br />
具体业务功能场景包括：<br />
（一）订台、下单功能<br />
我们的产品与/或服务为您提供订台功能，在此过程中，我们需要收集您的一些信息，包括如下个人信息：设备型号、设备名称、设备标识、浏览器类型和设置、语言设置、操作系统和应用程序版本、登录IP地址、接入网络的方式、网络质量数据、移动网络信息（包括运营商名称）、产品版本号、日志信息（如操作日志、服务日志）。同时为了收集上述基本的个人设备信息，我们将会申请访问您的设备信息的权限，如您拒绝提供上述权限将可能导致您无法使用我们的产品与服务。<br />
（二）搜索功能<br />
当您使用搜索功能时，我们需要收集您的一些信息，包括如下个人信息：搜索的字词（包括语音信息）、浏览记录和时间、搜索的时间以及与它们互动的次数。我们收集这些信息是为了向您提供您所需要的内容和可能更感兴趣的服务，同时亦可以改进我们的产品和服务。
(三) 账号注册功能<br />
当您使用账号注册功能时，您需要按照我们的指引完成一系列注册程序，在您成为注册用户后，我们将为您提供专属于注册用户的产品与/或服务。在此过程中，您需要提供给我们一些单独或者结合识别您的用户身份的信息，包括：手机号码、验证码匹配结果。我们收集这些信息是用以完成注册程序、为您持续稳定提供服务，并保护您的账号安全。您应知悉，手机号码和验证码匹配结果属于您的个人敏感信息，我们收集该类信息是为了满足相关法律法规的要求，如您拒绝提供可能导致您无法使用我们的此功能，请您谨慎考虑后再提供。同时，您也可以在注册时或后续使用过程中填写或补充您的性别、昵称、头像、生日、个性签名信息，如您未填写或后续删除、变更此类信息不会影响注册及会员功能的正常使用。<br />
您知悉并同意，对于您在使用产品与/或服务的过程中提供的您的一种或多种联系方式（例如：电子邮箱、联系电话、传真号码、联系地址），我们在运营中可能会向其中的一种或多种发送多类通知，用于用户消息告知、身份验证、安全验证等用途；此外，我们也可能会将在前述过程中收集的手机号码、电子邮箱通过短信、电话、邮件的方式用作向您提供您可能感兴趣的广告、商业活动等商业性信息的用途，但请您放心，如您不愿接受该商业性信息，您可以通过手机短信、电子邮件中提供的退订方式进行退订，也可以直接与夜乐科技联系进行退订。<br />
 (四) 基于位置权限的业务功能<br />
在我们的特定服务中，我们需要申请获取您的位置权限，并在您授权后收集您的位置信息，前述特定服务场景包括：快速匹配附近门店订台。位置权限是您设备上的一项设置，您可以通过设备设置页面进行管理。同时，您也可以随时通过产品上的相关功能设置开启/取消该权限，例如：“手机端夜乐门店APP”的路径为：我的—设置—隐私—隐私设置。您开启该权限即视为您授权我们可以访问、获取、收集、使用您的该等个人信息；但当您取消该授权后，我们将不再收集该信息，也无法再为您提供上述与之对应的服务；但除非您依照法律的规定删除了您的个人信息，否则您的取消行为不会影响我们基于您之前的授权进行的个人信息的处理、存储。<br />
（五）下单与交付<br />
当您在我们的产品与/或服务中代替顾客购买商品或服务的，我们需要根据商品或服务类型收集如下部分或全部的个人信息，包括：交易商品或服务信息、交易金额、下单时间、订单商户、订单编号、订单状态、支付方式、支付账号、支付状态（个人敏感信息），我们收集这些信息是为了帮助您顺利完成交易、保障您的交易安全、查询订单信息、提供服务等。
我们向您承诺，我们会以最大努力保障您的个人信息安全，我们不会对外泄露或做其他任何用途。<br />
(六) 身份认证功能<br />
当您使用我们的产品与/或服务中的身份认证功能或服务时，为满足相关法律规定及监管要求、确保用户身份真实性、实现反欺诈等风险控制、保障系统和服务安全或提供服务之需要，我们将需要收集您的真实身份信息（可能包括姓名、身份证相关信息、面部特征信息（静态或动态）、手机号码）（个人敏感信息）以完成实名认证，相关业务场景可能包括：注册产品时、进行提现操作时。为实现实名认证的目的，您同意我们可以自行或委托第三方向有关机构（如个人征信机构、政府机构等）提供、查询、核对您的前述身份信息。在您实名认证成功后，如无正当事由，实名信息将无法修改，如确需修改，请您与我们联系解决。<br />
同时，为协助您快速完成实名认证、风控核验等，对于您曾经在我们的产品与/或服务中提供的相关实名认证信息（包括姓名、身份证相关信息、手机号码）（个人敏感信息），您同意我们可以将前述信息的全部或部分自动预填于其他需要您实名认证的页面，您知悉并认可，我们仅协助填写，并未直接传输，只有在您点击下一步操作后才由您自行提供至对应服务系统。
（七）产品安全保障功能<br />
我们需要收集您的一些信息来保障您使用我们的产品与/或服务时的账号与系统安全，并协助提升我们的产品与/服务的安全性和可靠性，以防产生任何危害用户、夜乐科技、社会的行为，包括：您的如下个人信息：账号登录地、个人常用设备信息（例如：硬件型号、设备MAC地址、IMEI、IMSI）、登录IP地址、产品版本号、语言模式、浏览记录、网络使用习惯、服务故障信息，以及个人敏感信息：交易信息、会员实名认证信息。我们会根据上述信息来综合判断您账号、账户及交易风险、进行身份验证、客户服务、检测及防范安全事件、诈骗监测、存档和备份用途，并依法采取必要的记录、审计、分析、处置措施，一旦我们检测出存在或疑似存在账号安全风险时，我们会使用相关信息进行安全验证与风险排除，确保我们向您提供的产品和服务的安全性，以用来保障您的权益不受侵害。同时，当发生账号或系统安全问题时，我们会收集这些信息来优化我们的产品和服务。<br />
此外，为确保您设备操作环境的安全以及提供我们的产品与/或服务所必需，防止恶意程序和反作弊，我们会在您同意本《夜乐门店隐私政策》后获取您设备上已安装或正在运行的必要的应用/软件列表信息（包括应用/软件来源、应用/软件总体运行情况、崩溃情况、使用频率等）。请您知悉，单独的应用/软件列表信息无法识别您的特定身份。<br />
从外部第三方间接收集的您的个人信息<br />
您知悉，您向外部第三方（夜乐科技旗下公司不在此限）提供的个人信息，或外部第三方收集的您的个人信息，我们无法获取，更不会使用非常规方式（如：恶意干预对方系列APP数据）擅自以软件程序获得您的个人信息。如果因业务发展的必要而需要从第三方间接收集（如共享等）您的个人信息的，且由我们直接或联合为您提供产品或服务的，我们（或第三方）在收集前会向您明示共享的您个人信息的来源、类型、使用目的、方式和所用于的业务功能、授权同意范围（如果使用方式和范围超出您在第三方原授权范围的，我们会再次征得您的授权同意），此种场景包括您通过第三方账户直接登录我们的产品与/或服务时，我们从第三方获取的您授权共享的账户信息（包括头像、昵称）、我们的某些产品/服务由业务合作伙伴提供或者我们与业务合作伙伴共同提供时，为了必要/合理的业务的顺利开展，我们从部分业务合作伙伴处间接收集的您的部分信息、其他方使用我们的产品与/或服务时所提供有关您的信息<br />
此外，我们会在间接收集您的个人信息前，明确以书面形式（如协议、承诺书）要求该第三方在已经取得您明示同意后收集个人信息，并向您告知共享的信息内容，且涉及敏感信息的在提供给我们使用前需经过您的再次确认，在协议等层面要求第三方对个人信息来源的合法性和合规性作出承诺，如第三方有违反行为的，我们会明确要求对方承担相应法律责任；同时，我们的专业安全团队对个人信息进行安全加固（包括敏感信息报备、敏感信息加密存储、访问权限控制等）。我们会使用不低于我们对自身用户个人信息同等的保护手段与措施对间接获取的个人信息进行保护。<br />
（八）其他<br />
如上文所述，如果某一需要收集您的个人信息的功能或产品/服务未能在本《夜乐门店隐私政策》中予以说明的，或者我们超出了与收集您的个人信息时所声称的目的及具有直接或合理关联范围的，我们将在收集和使用你的个人信息前，通过更新本《夜乐门店隐私政策》、页面提示、弹窗、消息通知、网站公告或其他便于您获知的方式另行向您说明，并为您提供自主选择同意的方式，且在征得您明示同意后收集和使用。<br />
例外情形<br />
另外，您充分理解并同意，我们在以下情况下收集、使用您的个人信息无需您的授权同意：<br />
    与国家安全、国防安全有关的；<br />
    与公共安全、公共卫生、重大公共利益有关的；<br />
    与犯罪侦查、起诉、审判和判决执行等直接相关的；<br />
    出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；<br />
    所收集的信息是您自行向社会公开的或者是从合法公开的渠道（如合法的新闻报道、政府信息公开等渠道）中收集到的；<br />
    根据与您签订和履行相关协议或其他书面文件所必需的；<br />
    用于维护我们的产品与/或服务的安全稳定运行所必需的，例如：发现、处置产品与/或服务的故障；<br />
    有权机关的要求、法律法规等规定的其他情形。<br />
<br />
<b>三、我们如何使用Cookie和同类技术</b><br /><br />
（一）关于Cookie和同类技术<br />
Cookie是包含字符串的小文件，在您登入和使用网站或其他网络内容时发送、存放在您的计算机、移动设备或其他装置内（通常经过加密）。Cookie同类技术是可用于与Cookie类似用途的其他技术，例如：Web Beacon、Proxy、嵌入式脚本等。<br />
目前，我们主要使用Cookie收集您的个人信息。您知悉并同意，随着技术的发展和我们产品和服务的进一步完善，我们也可能会使用Cookie同类技术。<br />
（二）我们如何使用Cookie和同类技术<br />
在您使用我们的产品与/或服务时，我们可能会使用Cookie和同类技术收集您的一些个人信息，包括：您访问网站的习惯、您的浏览信息、您的登录信息，Cookie和同类技术收集该类信息是为了您使用我们的产品与/或服务的必要、简化您重复操作的步骤（如注册、登录）、便于您查看使用历史（如视频观看历史）、向您提供更切合您个人需要的服务内容和您可能更感兴趣的内容、保护您的信息和账号安全性、改善我们的产品和服务等。我们承诺仅在本《夜乐门店隐私政策》所述目的范围内使用Cookie和同类技术。<br />
如果您的浏览器允许，您可以通过您的浏览器的设置以管理、（部分/全部）拒绝Cookie与/或同类技术；或删除已经储存在您的计算机、移动设备或其他装置内的Cookie与/或同类技术，从而实现我们无法全部或部分追踪您的个人信息。您如需详细了解如何更改浏览器设置，请具体查看您使用的浏览器的相关设置页面。您理解并知悉：我们的某些产品/服务只能通过使用Cookie或同类技术才可得到实现，如您拒绝使用或删除的，您可能将无法正常使用我们的相关产品与/或服务或无法通过我们的产品与/或服务获得最佳的服务体验，同时也可能会对您的信息保护和账号安全性造成一定的影响。<br />
四、我们如何共享、转让、公开披露您的个人信息<br />
（一）共享<br />
我们会重视对您的个人信息的保护，您的个人信息是我们为您提供产品与/或服务的重要依据和组成部分，对于您的个人信息，我们仅在本《夜乐门店隐私政策》所述目的和范围内或根据法律法规的要求收集和使用，并严格保密，我们不会与夜乐科技以外的第三方公司、组织和个人共享您的个人信息，除非存在以下一种或多种情形：<br />
    您自行提出要求的；<br />
    事先已征得您的明确授权同意；<br />
    夜乐科技内部的必要、合理共享；包括：<br />

    （1）为便于我们基于夜乐科技统一的账号体系向您提供一致化服务、向您推荐您可能更感兴趣的内容、保障和提升我们的服务与系统的安全性和可靠性、保护夜乐科技或用户或公众的人身财产安全免遭侵害以及便于您进行统一管理，您知悉并同意，您的相关个人信息可能会在夜乐科技的产品内部（例如：夜乐门店、夜乐平台）进行必要共享，但请您放心，我们只会在必要和合理范围内共享信息且仅在前述目的范围内进行处理（例如：当您使用夜乐门店账号登录夜乐科技的其他产品时，我们会向其共享您的必要账户信息，该账号下的相关数据记录也可能会进行共享与关联；如您已经在夜乐门店产品中注册了账号的，您亦可以直接使用前述账号和密码登录夜乐科技的其他产品），如果我们需要共享您的个人敏感信息或关联公司需要改变个人信息的使用及处理目的时，我们会将再次征求您的授权同意；<br />

    与部分业务合作伙伴的必要共享；
    您理解并同意，为了必要/合理的业务的顺利开展、满足您的要求、履行我们在相关用户协议或本隐私政策中的义务和行使我们的权利或遵守法律规定等目的，我们可能需要向部分业务合作伙伴共享您的部分信息。但我们承诺我们只会共享您的必要个人信息，如果我们共享您的个人敏感信息或改变个人信息的使用及处理目的，我们会将再次征求您的授权同意。我们的业务合作伙伴包括：<br />

    （1）为我们的产品与/或服务提供功能支持的服务提供商：包括：提供支付服务的支付机构、提供一键登录服务的运营商、第三方配送公司和其他服务提供商，我们共享信息的目的是可以实现我们产品与/或服务的功能，让您可以正常使用；

    （2）我们平台的第三方商家：为实现您购买产品或服务的需求（包括享受售后服务），我们会将您的订单信息与交易相关的信息共享给我们平台的第三方商家；

    （3）提供数据服务（包括网络广告监测、数据统计、数据分析）的合作伙伴：为维护/改进我们的产品/服务、为您提供更好的内容，我们可能会与提供该服务的指定合作伙伴共享您的相关信息，为了您的信息安全，我们目前仅与已签署严格数据安全保密协议的合作伙伴进行合作，包括：索瑞福、艾瑞咨询集团等，且这些公司必须遵守我们的数据隐私和安全要求。除非得到您的同意，我们不会与其共享您的个人身份信息；<br />

    （4）第三方SDK类服务商：我们产品中可能会包含第三方SDK或其他类似的应用程序，如您在我们平台上使用这类由第三方提供的服务时，您同意将由其直接收集和处理您的信息（如以嵌入代码、插件等形式），例如：如您使用华为手机的，华为Push SDK需要读取您的IMEI信息，用于推送/下发通知栏消息；当您使用小米账号登录我们的产品时，小米SDK需要收集您的小米账号信息；如您使用支付宝付款的，为了让您能够在交易安全的环境中完成交易、实现交易目的，支付宝SDK需要读取您的IMEI信息。前述服务商收集和处理信息等行为遵守其自身的隐私条款，而不适用于本政策。但我们也会努力审查该第三方的业务准入资质并努力要求该等服务商的合法合规性与安全性。为了最大程度保障您的信息安全，我们强烈建议您在使用任何第三方SDK类服务前先行查看其隐私条款。为保障您的合法权益，如您发现这等SDK或其他类似的应用程序存在风险时，建议您立即终止相关操作并及时与我们取得联系；<br />

    共享的是去标识化的信息，且接受该信息共享的第三方无法重新识别信息主体身份；<br />
    为了保护您、我们的其他用户或员工、夜乐科技或社会公共利益、财产或安全（例如：欺诈或信用风险等）免遭损害而与第三方的共享；<br />
    某些情况下，只有共享您的个人信息，才能实现我们的产品与/或服务的核心功能或提供您需要的服务，或处理您与他人的纠纷或争议；<br />
    依据您与我们签署的相关协议（例如：在线协议、平台规则等）或法律文件而共享的；<br />
    符合您与其他第三人之间的有关约定的；<br />
    基于合理商业习惯而共享的，例如：与第三方共享联合营销活动中的中奖/获胜者等信息，以便其能及时向您发放奖品/礼品等；我们接受尽调时等；<br />
    基于学术研究而使用，例如：以学术研究为目的而与学术机构共享我们使用您的相关信息集合形成的间接用户画像、去标识化或匿名化处理后的分析/统计类信息（未经您的同意，我们不会与其共享可以识别您身份的个人信息）；学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行匿名化处理的；<br />
    有权机关的要求、诉讼争议需要、法律法规等规定的其他需要共享的情形。<br />

您可以基于夜乐科技的平台与第三人（包括不特定对象）共享您的个人信息或其他信息，但因您的共享行为而导致的信息泄露、被使用等情况，与夜乐科技无关，您需要自行承担相应的法律责任。<br />
我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享必要的个人信息。在我们与业务合作伙伴共享信息时，我们会以多种方式保护您的个人信息，包括但不限于：（1）如具备上述合理事由且需要您授权同意的，我们会在共享前向您告知共享的信息的目的、类型（如涉及您的个人敏感信息的，我们还会向您告知涉及的敏感信息的内容）并在取得您授权同意后再共享；（2）在合作协议层面，我们会严格要求合作伙伴的信息保护义务与责任，为此，我们的法律部门要求业务合作伙伴在合作前需与夜乐科技签署关于数据安全的保护协议，协议严格约定了业务合作伙伴的用户信息保密义务，包括信息的保管、使用和流转等均应满足我们的管控要求，接受我们的审核、监督等，一旦有任何违反，将须承担相应法律责任；（3）此外，我们的安全团队将对信息数据的输出形式、流转、使用等做安全评估与处理等。请您知悉，即使已经取得您的授权同意，我们也仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并尽量对共享内容中的个人信息进行匿名化处理。您理解并知悉，匿名化处理后的信息无法指向与识别您，已不属于法律意义上的个人信息，其处理、使用、共享、转让无需征得您的授权同意。<br />
（二）转让<br />
转让是指将个人信息控制权向其他公司、组织或个人转移的过程。原则上我们不会将您的个人信息转让，但以下情况除外：<br />

    您自行提出要求的；<br />
    事先已征得您的明确授权同意；<br />
    如我们进行兼并、收购、重组、分立、破产、资产转让或类似的交易，而您的个人信息有可能作为此类交易的一部分而被转移，我们会要求新持有人继续遵守和履行该《夜乐门店隐私政策》的全部内容（包括使用目的、使用规则、安全保护措施等），否则我们将要求其重新获取您的明示授权同意；<br />
    法律法规等规定的其他情形。<br />

如具备上述事由确需转让的，我们会在转让前向您告知转让的信息的目的、类型（如涉及您的个人敏感信息的，我们还会向您告知涉及的敏感信息的内容），并在征得您的授权同意后再转让，但法律法规另有规定的或本政策另有约定的除外。<br />
（三）公开披露<br />
公开披露是指向社会或不特定人群发布信息的行为。除了因需要对违规账号、欺诈行为等进行处罚公告、公布中奖/获胜者等名单时脱敏展示相关信息等必要事宜而进行的必要披露外，我们不会对您的个人信息进行公开披露，如具备合理事由确需公开披露的，我们会在公开披露前向您告知公开披露的信息的目的、类型（如涉及您的个人敏感信息的，我们还会向您告知涉及的敏感信息的内容），并在征得您的授权同意后再公开披露，但法律法规另有规定的或本政策另有约定的除外。<br />
对于公开披露的您的个人信息，我们会充分重视风险，在收到公开披露申请后第一时间且审慎审查其正当性、合理性、合法性，并在公开披露时和公开披露后采取不低于本《夜乐门店隐私政策》约定的个人信息安全保护措施和手段的程度对其进行保护。<br />
请您知悉，即使已经取得您的授权同意，我们也仅会出于合法、正当、必要、特定、明确的目的公开披露您的个人信息，并尽量对公开披露内容中的个人信息进行匿名化处理。<br />
例外情形<br />
根据法律法规等规定，在下述情况下，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：<br />

    与国家安全、国防安全直接相关的；<br />
    与公共安全、公共卫生、重大公共利益直接相关的；<br />
    与犯罪侦查、起诉、审判和判决执行等直接相关的；或根据法律法规的要求、行政机关或公检法等有权机关的要求的；<br />
    出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；<br />
    个人信息是您自行向社会公开的或者是从合法公开的渠道（如合法的新闻报道、政府信息公开等渠道）中收集到的；<br />
    根据与您签订和履行相关协议或其他书面文件所必需的；<br />
    法律法规等规定的其他情形。<br />
<br />
<b>（四）共享、转让、公开披露的相关责任</b><br /><br />
我们将严格按照本隐私政策的约定及相关法律法规的要求执行对个人信息的共享、转让、公开披露的操作，如因我们的过错原因导致您的合法权益遭受损害的，我们愿意就我们的过错在法律规定的范围内向您承担相应的损害赔偿责任。<br />
<br />
<b>五、您对个人信息享有的控制权</b><br /><br />
您对我们产品与/或服务中的您的个人信息享有多种方式的控制权，包括：您可以访问、更正/修改、删除您的个人信息，也可以撤回之前作出的对您个人信息的同意，同时您也可以注销您的夜乐门店账号。为便于您行使您的上述控制权，我们在产品的相关功能页面为您提供了操作指引和操作设置，您可以自行进行操作，如您在操作过程中有疑惑或困难的可以通过文末的方式联系我们来进行控制，我们会及时为您处理。<br />
（一）访问权<br />
您可以在我们的产品与/或服务中查询或访问您的相关个人信息，包括：<br />

    账号信息：您可以通过相关产品页面随时登录您的个人账号，以访问您的账号中的个人资料信息，包括：头像、昵称、生日、性别、个性签名等，例如： “头像/昵称/生日/性别/个性签名”信息在“手机端夜乐门店APP”中的更正/修改路径为：我的—个人资料；<br />
    其他信息：如您在此访问过程中遇到操作问题的或如需获取其他前述无法获知的个人信息内容，您可通过文末提供的方式联系我们，我们将在核实您的身份后在合理期限内向您提供，但法律法规另有规定的或本政策另有约定的除外。<br />

（二）更正/修改权<br />
您可以在我们的产品与/或服务中更正/修改您的相关个人信息。为便于您行使您的上述权利，我们为您提供了在线自行更正/修改和向我们提出更正/修改申请两种方式。<br />
对于您的部分个人信息，我们在产品的相关功能页面为您提供了操作指引和操作设置，您可以直接进行更正/修改，例如：“头像/昵称/生日/性别/个性签名”信息在“手机端夜乐门店APP”中的更正/修改路径为：我的—个人资料；<br />
对于您在行使上述权利过程中遇到的困难，或其他可能未/无法向您提供在线自行更正/修改权限的， 经对您的身份进行验证，且更正不影响信息的客观性和准确性的情况下，您有权对错误或不完整的信息作出更正或修改，或在特定情况下，尤其是数据错误时，通过我们公布的反馈与报错等措施将您的更正/修改申请提交给我们，要求我们更正或修改您的数据，但法律法规另有规定的除外。但出于安全性和身份识别的考虑，您可能无法修改注册时提交的某些初始注册信息。<br />
（三）删除权<br />
一般而言，我们只会在法律法规规定或必需且最短的时间内保存您的个人信息。为便于您行使您的上述删除权，我们为您提供了在线自行删除和向我们提出删除申请两种方式。<br />
对于您的部分个人信息，我们在产品的相关功能页面为您提供了操作指引和操作设置，您可以直接进行删除<br />
在以下情形下，您可以直接向我们提出删除您个人信息的请求，但已做数据匿名化处理或法律法规另有规定的除外。<br />

    我们违反法律法规规定，收集、使用您的个人信息的；<br />
    我们违反了与您的约定，收集、使用您的个人信息的；<br />
    法律法规等规定的其他情形。<br />

关于您不再使用我们提供的产品与/或服务且注销夜乐门店账号后、以及我们终止部分或全部产品与/或服务后我们对您的个人信息的处理，我们将在本文其他专门章/节中为您详细作出说明。<br />
您理解并同意：当您从我们的产品与/或服务中删除信息后，我们可能不会立即从备份系统中删除相应的信息，但会在备份更新时删除这些信息。<br />
（四）索取权<br />
如您需要您的个人数据的副本，您可以通过本《夜乐门店隐私政策》文末提供的方式联系我们，在核实您的身份后，我们将向您提供您在我们的服务中的个人信息副本（包括基本资料、身份信息），但法律法规另有规定的或本政策另有约定的除外。<br />
(五) 撤回同意权<br />
如您想更改相关权限的授权（例如：位置、通讯录、相机、相册、麦克风、日历），您可以通过您的硬件设备进行修改、或在我们的产品或服务中的相关功能设置界面进行操作处理（例如：“位置”权限在“手机端夜乐门店APP”中的撤回同意路径为：我的—设置—隐私—隐私设置）。您也可以通过注销夜乐门店账号的方式，永久撤回我们继续收集您个人信息的全部授权。如您在此过程中遇到操作问题的，可以通过本《夜乐门店隐私政策》文末提供的方式联系我们。<br />
（六）注销权<br />
我们为您提供夜乐门店账号注销的多种途径，您可以通过在线申请注销或联系我们的客服或通过其他我们公示的方式申请注销您的账号。在您注销夜乐门店账号后，您将无法再以此账号登录和使用夜乐科技旗下的相关产品与服务；该账号在夜乐科技旗下的产品与服务使用期间已产生的但未消耗完毕的权益及未来的逾期利益等全部权益将被清除；该账号下的内容、信息、数据、记录等将会被删除或匿名化处理（但法律法规另有规定或监管部门另有要求的除外）；同时，夜乐门店账号一旦注销完成，将无法恢复。<br />
（七）提前获知产品与/或服务停止运营权<br />
我们将持续为您提供优质服务，若因特殊原因导致我们的部分或全部产品与/或服务被迫停止运营，我们将提前在显著位置或向您发送推送消息或以其他方式通知您，并将停止对您个人信息的收集，同时在超出法律法规规定的必需且最短期限后，我们将会对所持有的您的个人信息进行删除或匿名化处理。<br />
（八）帮助反馈权<br />
我们为您提供了多种反馈渠道，具体请见本政策“如何联系我们”章节。<br />
例外情形<br />
请您理解并知悉，根据法律法规等规定，在下述情况下，我们可能不会响应您的关于访问、更正/修改权、删除权、撤回同意权、注销权、索取权的请求：<br />

    与国家安全、国防安全有关的；<br />
    与公共安全、公共卫生、重大公共利益有关的；<br />
    与犯罪侦查、起诉、审判和判决执行等有关的；<br />
    我们有充分证据表明您存在主观恶意或滥用权利的；<br />
    响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；<br />
    涉及商业秘密的；<br />
    法律法规等规定的其他情形。<br />
<br />
<b>六、我们如何存储和保护您的个人信息</b><br /><br />
（一）个人信息的存储<br />

    存储地点：我们依照法律法规的规定，将您的个人信息存储于中华人民共和国境内。目前我们暂时不存在跨境存储您的个人信息或向境外提供个人信息的场景。如需跨境存储或向境外提供个人信息的，我们会单独向您明确告知（包括出境的目的、接收方、使用方式与范围、使用内容、安全保障措施、安全风险等）并再次征得您的授权同意，并严格要求接收方按照本《夜乐门店隐私政策》以及其他相关要求来处理您的个人信息；<br />
    存储期限：我们在为提供我们的产品和服务之目的所必需且最短的期间内保留您的个人信息，例如：当您使用我们的注册及会员功能时，我们需要收集您的手机号码，且在您提供后并在您使用该功能期间，我们需要持续为您保留您的手机号码，以向您正常提供该功能、保障您的账号和系统安全。在超出上述存储期限后，我们会对您的个人信息进行删除或匿名化处理。但您行使删除权、注销账号的或法律法规另有规定的除外（例如：《电子商务法》规定：商品和服务信息、交易信息保存时间自交易完成之日起不少于三年）。<br />

(二) 个人信息的保护措施<br />
我们一直都极为重视保护用户的个人信息安全，为此我们采用了符合行业标准的安全技术措施及配套的组织架构和管理体系等多层面保护措施以最大程度降低您的信息被泄露、毁损、误用、非授权访问、非授权披露和更改的风险。包括：

    数据安全技术措施<br />

    （1）数据安全收集方面，通过个人信息安全影响评估确认数据收集的合法性、正当性和必要性，识别并以清晰、准确的方式告知用户以征得同意，同时对用户的授权同意采集行为进行日志记录；采用敏感识别工具对收集的用户数据进行分类分级，针对不同级别的数据设置不同等级的安全策略；采用技术措施对收集或产生数据的来源方进行身份识别，确保数据来源的准确性和抗抵赖性；<br />

    （2） 数据安全传输方面，使用安全通道传输个人信息，并通过合适的加密算法进行安全加密、脱敏处理，确保数据传输过程中个人信息的秘密性和完整性；<br />

    （3）数据安全存储方面，采用数据分类分级管理制度，针对数据分类分级结果采取不同的信息存储策略；采用数据分类分级管理制度，针对数据分类分级结果采取不同的信息存储策略；个人敏感信息需加密存储，确保数据安全使用规范能够落实到位；针对存储有个人信息的数据库加强权限控制与安全审计；定期对个人信息进行备份与恢复，确保个人信息在存储使用过程中的完整性；<br />

    （4）数据安全处理方面，依照使用场景和安全需求对个人信息进行脱敏处理，例如：在前端显示个人敏感信息之前需在服务端完成脱敏处理；开发、测试环境严禁使用真实用户信息；实施严格的数据权限控制机制，采取多重身份认证、网络/数据隔离等技术措施，确保能够对处理个人信息的行为进行有效监控，避免数据被违规访问和未授权使用；<br />

    （5）数据安全销毁方面，根据法律法规要求和业务实际需求设定个人信息存储的最小可用期限，对到期的数据通过安全删除技术进行处理，确保已销毁数据不可恢复，技术手段包括但不限于数据彻底清除方案、磁盘销毁、物理销毁等；<br />

    （6） 建立完整的审计机制，对数据生命周期的全流程进行监控与审计，防止您的个人信息遭遇未经授权的访问、公开披露、使用、修改、人为或意外的损坏或丢失；<br />

    （7） 其他实现数据安全保护的措施。<br />
    数据安全组织和管理措施<br />

    （1）成立专门的个人信息保护责任部门，建立相关的内控管理流程，对可能接触到您的信息的工作人员采取最小化权限原则；<br />

    （2）建立数据分类分级制度、业务数据安全使用规范、数据合作规范等管理体系，保障您的信息在收集、传输、使用、存储、转移、销毁等环节的处置满足法律法规相关规范和安全要求；<br />

    （3）定期组织员工参加安全与隐私保护相关培训并要求完成规定的考核，加强员工对于保护个人信息重要性的认知；<br />

    （4）通过公安部信息安全等级保护三级认证，并与监管机构、第三方测评机构建立了良好的协调联动机制，及时抵御并处置各类信息安全威胁，为您的信息安全提供全方位保障；<br />

    （5）其他可行的安全组织和管理措施。<br />
    合作协议条款保证<br />

    （1）在我们从第三方间接收集您的个人信息前，我们会明确以书面形式（如合作协议、承诺书）要求该第三方在已经取得您明示同意后收集以及处理（如共享等）个人信息，在书面协议层面要求第三方对个人信息来源的合法性和合规性作出承诺，如第三方有违反行为的，我们会明确要求该第三方承担相应法律责任；<br />

    （2）在我们向业务合作伙伴共享您的个人信息前，我们会严格要求合作伙伴的信息保护义务与责任，并要求业务合作伙伴在合作前签署关于数据安全的保护协议，一旦业务合作伙伴有任何违反协议的行为，将须承担相应法律责任；<br />

    （3）其他合作协议中明确约定的内容。<br />
    安全事件的处理<br />

    （1）我们建立了合理有效、科学健全的安全应急响应体系，制定了《网络安全事件应急响应预案》、《紧急安全事件响应机制》、《重大事件应急预案》、《数据安全事件管理规范》等多项安全管理制度，明确了网络安全事件的分类分级标准、安全应急响应组织及职责，并根据安全事件的不同类型和级别制定了适当的应急响应预案，明确规范了安全事件的报告流程和应急响应处置流程（包括研判、分析、抑制、根除、恢复、结果公布和经验总结）。同时，我们还具备夜乐科技安全应急响应中心，由专业的安全技术和运营团队负责维护，便于及时有效的响应、处置各类安全漏洞和突发事件，联合相关部门进行安全事件溯源和打击；<br />

    （2）如不幸发生个人信息安全事件的，我们将按照法律法规的要求，及时向您告知安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、电话、短信、推送通知、信件等一种或多种方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况；<br />

    （3）请您知悉并理解，互联网并非绝对安全的环境，我们强烈建议您通过安全方式、使用复杂密码，协助我们保证您的账号安全。如您发现自己的个人信息泄密，尤其是您的账户或密码发生泄露，请您立即根据本隐私政策文末中提供的联系方式联络我们，以便我们采取相应措施来保护您的信息安全。
<br /><br />
<b>七、本《夜乐门店隐私政策》的更新</b><br /><br />
我们鼓励您在每次使用我们的产品或服务时都查阅我们的《夜乐门店隐私政策》。为了给您提供更好的服务，我们会根据产品的更新情况及法律法规的相关要求更新本《夜乐门店隐私政策》的条款，该等更新构成本《夜乐门店隐私政策》的一部分。如该等更新造成您在本《夜乐门店隐私政策》下权利的实质减少或重大变更，我们将在本政策生效前通过在显著位置提示或向您发送推送消息或以其他方式通知您，若您继续使用我们的服务，即表示您充分阅读、理解并同意受经修订的《夜乐门店隐私政策》的约束。为保障您的合法权益，我们建议您可以定期在我们平台的设置页面中查看本政策。<br />
上述的“重大变更”包括但不限于：<br />

    我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息的类型、个人信息的使用方式等；<br />
    我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；<br />
    个人信息共享、转让或公开披露的主要对象发生变化；<br />
    您参与个人信息处理方面的权利及其行使方式发生重大变化；<br />
    我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；<br />
    个人信息安全影响评估报告表明存在高风险时；<br />
    其他重要的或可能严重影响您的个人权益的情况发生时。<br />
<br />
<b>八、如何联系我们</b><br /><br />
（一）如您对本《夜乐门店隐私政策》的执行或使用我们的服务时遇到的与隐私保护相关的事宜有任何问题（包括问题咨询、投诉等），我们专门为您提供了多种反馈通道，希望为您提供满意的解决方案：<br />
    公司地址： 您可写信至以下地址来与其联系：广东省广州市天河区元岗路310号智汇创意园 B座302-303单元<br />

（二）我们会在收到您的意见及建议后，并在验证您的用户身份后的30日内或法律法规规定的期限内尽快向您回复，一般情况下，我们不会因此对您收取服务费。但是，在以下情形下，您理解并知悉，我们将无法响应您的请求：<br />

    与国家安全、国防安全有关的；<br />
    与公共安全、公共卫生、重大公共利益有关的；<br />
    与犯罪侦查、起诉和审判等有关的；<br />
    有充分证据表明您存在主观恶意或滥用权利的；<br />
    响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；<br />
    涉及商业秘密的；<br />
    法律法规等规定的其他情形。<br />

（三）如果您对我们的回复不满意，或我们对您个人信息的处理方式侵害了您的合法权益，且在您向我们反馈后我们仍拒绝改进的，您可以向工商、公安等监管部门进行投诉、举报。<br />
<br />
<b>九、其他</b><br /><br />
（一）本《夜乐门店隐私政策》的解释及争议解决均应适用中华人民共和国大陆地区法律。与本《夜乐门店隐私政策》相关的任何纠纷，双方应协商友好解决；若不能协商解决，您同意将争议提交至北京市海淀区人民法院诉讼解决。<br />
（二）本《夜乐门店隐私政策》的标题仅为方便及阅读而设，并不影响正文其中任何规定的含义或解释。<br />

    <br /><br /><br /><div style='float:right'>夜乐科技</div><br /><br /><br />
            `
        }
    },
}
</script>

<style lang="scss" scoped>
</style>
